InformationRegisters/ДлительныеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДлительныеДействия</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ID_файла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвторДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресФайлаВХранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыполненоСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействиеЗавершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяДействияДляФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаименованиеДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектДействия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДлительныеДействияЗадача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДлительныеДействияЗадача</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДействиПриЗавершении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДДействия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.Задачи_ПКД</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи_РКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДлительныеДействия/Ext/ManagerModule.bsl
Функция СоздатьДлительноеДействие(ОбъектДействия, НаименованиеДействия) Экспорт

	УИДДействия = Строка(Новый УникальныйИдентификатор());
	
	МенеджерЗаписи = РегистрыСведений.ДлительныеДействия.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектДействия 		= ОбъектДействия;
	МенеджерЗаписи.УИДДействия 			= УИДДействия;
	МенеджерЗаписи.АвторДействия 		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Дата 				= ТекущаяДата();
	МенеджерЗаписи.НаименованиеДействия = НаименованиеДействия;
	
	МенеджерЗаписи.Записать();
	
	Возврат УИДДействия;

КонецФункции // СоздатьДействие()

Функция СоздатьДлительноеДействиеДляКорректиовки(СтруктураПараметров, ДействиПриЗавершении) Экспорт
	
	Задача = СтруктураПараметров.ЗадачаСсылка;
	
	ТипЗадачи = ТипЗнч(Задача);
	
	Если Тип("СправочникСсылка.ИзделияКомплект") = ТипЗадачи ИЛИ Тип("СправочникСсылка.Композиции") = ТипЗадачи Тогда
		ЭтаЗадача = Ложь;
	Иначе	
		ЭтаЗадача = Истина;
	КонецЕсли;
	
	УИДДействия = Строка(Новый УникальныйИдентификатор());
	
	МенеджерЗаписи = РегистрыСведений.ДлительныеДействия.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектДействия 		= ?(ЭтаЗадача, Задача.ОбъектТЗ, Задача);
	МенеджерЗаписи.УИДДействия 			= УИДДействия;
	МенеджерЗаписи.АвторДействия 		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Дата 				= ТекущаяДата();
	МенеджерЗаписи.НаименованиеДействия = СтруктураПараметров.НаименованиеДействия;
	МенеджерЗаписи.ИмяДействияДляФайла 	= СтруктураПараметров.ИмяДействияДляФайла;
	
	//Если НЕ ЭтаЗадача Тогда
	//	
	//	МенеджерЗаписи.Записать();
	//	Возврат УИДДействия; 
	//	
	//КонецЕсли;
	//
	Попытка
		НачатьТранзакцию();
		
		МенеджерЗаписи.Записать();
		
		МенеджерЗаписи = РегистрыСведений.ДлительныеДействияЗадача.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Задача 				= Задача;
		МенеджерЗаписи.УИДДействия 			= УИДДействия;
		МенеджерЗаписи.ДействиПриЗавершении = ДействиПриЗавершении;
		
		МенеджерЗаписи.Записать();
		
		ЗафиксироватьТранзакцию();
		Возврат УИДДействия;
	Исключение
		ОтменитьТранзакцию();
		Возврат "";
	КонецПопытки;
	
	Возврат УИДДействия;
	
КонецФункции // СоздатьДействие()

Функция СоздатьДлительноеДействиеДляЗадачи(СтруктураПараметров, ДействиПриЗавершении) Экспорт
	
	Задача 					= СтруктураПараметров.ЗадачаСсылка;
	
	ТипЗадачи = ТипЗнч(Задача);
	
	Если ТипЗадачи = Тип("СправочникСсылка.ИзделияКомплект") ИЛИ ТипЗадачи = Тип("СправочникСсылка.Композиции") Тогда 
		ОбъектТЗ = Задача;
	Иначе
		ОбъектТЗ = Задача.ОбъектТЗ;
	КонецЕсли;
		
	УИДДействия = Строка(Новый УникальныйИдентификатор());
	
	МенеджерЗаписи = РегистрыСведений.ДлительныеДействия.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ОбъектДействия 		= ОбъектТЗ;
	МенеджерЗаписи.УИДДействия 			= УИДДействия;
	МенеджерЗаписи.АвторДействия 		= ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Дата 				= ТекущаяДата();
	МенеджерЗаписи.НаименованиеДействия = СтруктураПараметров.НаименованиеДействия;
	МенеджерЗаписи.ИмяДействияДляФайла 	= СтруктураПараметров.ИмяДействияДляФайла;
	
	Попытка
		НачатьТранзакцию();
		
		МенеджерЗаписи.Записать();
		
		МенеджерЗаписи = РегистрыСведений.ДлительныеДействияЗадача.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Задача 				= Задача;
		МенеджерЗаписи.УИДДействия 			= УИДДействия;
		МенеджерЗаписи.ДействиПриЗавершении = ДействиПриЗавершении;
		
		МенеджерЗаписи.Записать();
		
		ЗафиксироватьТранзакцию();
		Возврат УИДДействия;
	Исключение
		ОтменитьТранзакцию();
		Возврат "";
	КонецПопытки;
	
	Возврат УИДДействия;
	
КонецФункции // СоздатьДействие()
